Revit.Elements.ElementSelector.ByType``1(System.Boolean)
Get a collection of wrapped elements from the current document by type
The type of the Revit element to select
isRevitOwned: Whether the returned object should be revit owned or not
Returns:

Revit.Elements.ElementSelector.ByElementId(System.Int32,System.Boolean)
A factory method for looking up and obtaining elements
from the revit project.
elementId: The id of the element to select
isRevitOwned: Whether the returned object should be revit owned or not
Returns:

Revit.Elements.ElementSelector.ByUniqueId(System.String,System.Boolean)
A factory method for looking up and obtaining elements
from the revit project
uniqueId: The unique id of the element to select
isRevitOwned: Whether the returned object should be revit owned or not
Returns:

Revit.Elements.ElementSelector.InternalGetElementById(System.Int32)
Internal helper method to get an element from the current document by id
id:
Returns:

Revit.Elements.ElementSelector.InternalGetElementByUniqueId(System.String)
Obtain an element from the current document given the element's unique id
uniqueId:
Returns: